# 07_02: Loading Baby Names

In [ ]:
# note: this notebook requires Python 3.6 or higher

In [1]:
import math
import collections

import numpy as np
import pandas as pd
import matplotlib.pyplot as pp

%matplotlib inline

In [2]:
pd.options.display.max_rows = 8

In [3]:
import zipfile

In [4]:
zipfile.ZipFile('names.zip').extractall('.')

In [5]:
ls

07_02_loading.ipynb     07_04_topten.ipynb    names/
07_03_popularity.ipynb  07_06_solution.ipynb  names.zip

In [6]:
ls names

NationalReadMe.pdf  yob1907.txt  yob1935.txt  yob1963.txt  yob1991.txt
yob1880.txt         yob1908.txt  yob1936.txt  yob1964.txt  yob1992.txt
yob1881.txt         yob1909.txt  yob1937.txt  yob1965.txt  yob1993.txt
yob1882.txt         yob1910.txt  yob1938.txt  yob1966.txt  yob1994.txt
yob1883.txt         yob1911.txt  yob1939.txt  yob1967.txt  yob1995.txt
yob1884.txt         yob1912.txt  yob1940.txt  yob1968.txt  yob1996.txt
yob1885.txt         yob1913.txt  yob1941.txt  yob1969.txt  yob1997.txt
yob1886.txt         yob1914.txt  yob1942.txt  yob1970.txt  yob1998.txt
yob1887.txt         yob1915.txt  yob1943.txt  yob1971.txt  yob1999.txt
yob1888.txt         yob1916.txt  yob1944.txt  yob1972.txt  yob2000.txt
yob1889.txt         yob1917.txt  yob1945.txt  yob1973.txt  yob2001.txt
yob1890.txt         yob1918.txt  yob1946.txt  yob1974.txt  yob2002.txt
yob1891.txt         yob1919.txt  yob1947.txt  yob1975.txt  yob2003.txt
yob1892.txt         yob1920.txt  yob1948.txt  yob1976.txt  yob2004.txt
yob1893.txt         yob1921.txt  yob1949.txt  yob1977.txt  yob2005.txt
yob1894.txt         yob1922.txt  yob1950.txt  yob1978.txt  yob2006.txt
yob1895.txt         yob1923.txt  yob1951.txt  yob1979.txt  yob2007.txt
yob1896.txt         yob1924.txt  yob1952.txt  yob1980.txt  yob2008.txt
yob1897.txt         yob1925.txt  yob1953.txt  yob1981.txt  yob2009.txt
yob1898.txt         yob1926.txt  yob1954.txt  yob1982.txt  yob2010.txt
yob1899.txt         yob1927.txt  yob1955.txt  yob1983.txt  yob2011.txt
yob1900.txt         yob1928.txt  yob1956.txt  yob1984.txt  yob2012.txt
yob1901.txt         yob1929.txt  yob1957.txt  yob1985.txt  yob2013.txt
yob1902.txt         yob1930.txt  yob1958.txt  yob1986.txt  yob2014.txt
yob1903.txt         yob1931.txt  yob1959.txt  yob1987.txt  yob2015.txt
yob1904.txt         yob1932.txt  yob1960.txt  yob1988.txt  yob2016.txt
yob1905.txt         yob1933.txt  yob1961.txt  yob1989.txt  yob2017.txt
yob1906.txt         yob1934.txt  yob1962.txt  yob1990.txt  yob2018.txt

In [7]:
open('names/yob2011.txt','r').readlines()[:10]

['Sophia,F,21842\n',
 'Isabella,F,19910\n',
 'Emma,F,18803\n',
 'Olivia,F,17322\n',
 'Ava,F,15503\n',
 'Emily,F,14258\n',
 'Abigail,F,13248\n',
 'Madison,F,12389\n',
 'Mia,F,11530\n',
 'Chloe,F,10991\n']

In [8]:
pd.read_csv('names/yob2011.txt')

         Sophia  F  21842
0      Isabella  F  19910
1          Emma  F  18803
2        Olivia  F  17322
3           Ava  F  15503
...         ... ..    ...
33903     Zylas  M      5
33904     Zyran  M      5
33905   Zyshawn  M      5
33906  Zytavion  M      5

[33907 rows x 3 columns]

In [9]:
pd.read_csv('names/yob2011.txt', names=['name','sex','number'])

           name sex  number
0        Sophia   F   21842
1      Isabella   F   19910
2          Emma   F   18803
3        Olivia   F   17322
...         ...  ..     ...
33904     Zylas   M       5
33905     Zyran   M       5
33906   Zyshawn   M       5
33907  Zytavion   M       5

[33908 rows x 3 columns]

In [10]:
# load CSV file as DataFrame, then create a new column "year" with all elements set to 2011
pd.read_csv('names/yob2011.txt', names=['name','sex','number']).assign(year=2011)

           name sex  number  year
0        Sophia   F   21842  2011
1      Isabella   F   19910  2011
2          Emma   F   18803  2011
3        Olivia   F   17322  2011
...         ...  ..     ...   ...
33904     Zylas   M       5  2011
33905     Zyran   M       5  2011
33906   Zyshawn   M       5  2011
33907  Zytavion   M       5  2011

[33908 rows x 4 columns]

In [12]:
# for each year in 1880-2018, load the corresponding CSV file names/yobXXXX.txt
# as DataFrame, create new column "year" with all elements set to loop variable,
# then concatenate all DataFrames into a single one
allyears = pd.concat(pd.read_csv(f'names/yob{year}.txt',
                                 names=['name','sex','number']).assign(year=year)
                     for year in range(1880, 2019))

In [13]:
allyears.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1957046 entries, 0 to 32032
Data columns (total 4 columns):
 #   Column  Dtype
---  ------  -----
 0   name    object
 1   sex     object
 2   number  int64
 3   year    int64
dtypes: int64(2), object(2)
memory usage: 74.7+ MB

In [14]:
allyears.year.min(), allyears.year.max()

(1880, 2018)

In [15]:
# save DataFrame to compressed CSV file, dropping uninteresting index
allyears.to_csv('allyears.csv.gz', index=False)